[{
        "id_product": 1,
        "imgProduct": "img/product-card-1.png",
        "product_name": "Минник, Холланд: JavaScript для чайников",
        "description": "JavaScript - ключевой инструмент создания современных сайтов, и благодаря данному руководству, ориентированному на новичков, вы сможете изучить язык в короткие сроки и с минимумом усилий. Узнайте, какова структура языка, как правильно записывать его инструкции, как применять CSS, работать с онлайн-графикой и подключать программные интерфейсы HTML5. Все темы можно закрепить практическими упражнениями, доступными для выполнения на сайте Codecademy.com. Заложите основы. Узнайте, что собой представляет язык JavaScript, как он работает и где используется. Начните с самого простого. Освойте основные элементы JavaScript на примере простейших упражнений. Сведите все воедино. Научитесь применять переменные, массивы, операторы, условные конструкции и циклы.",
        "price": 1728
    },
    {
        "id_product": 2,
        "imgProduct": "img/product-card-2.png",
        "product_name": "Кирупа Чиннатамби: JavaScript с нуля",
        "description": "JavaScript еще никогда не был так прост! Вы узнаете все возможности языка программирования без общих фраз и неясных терминов. Подробные примеры, иллюстрации и схемы будут понятны даже новичку. Легкая подача информации и живой юмор автора превратят нудное заучивание в занимательную практику по написанию кода. Дойдя до последней главы, вы настолько прокачаете свои навыки, что сможете решить практически любую задачу, будь то простое перемещение элементов на странице или даже собственная браузерная игра.",
        "price": 1568
    },
    {
        "id_product": 3,
        "imgProduct": "img/product-card-3.png",
        "product_name": "Шолле, Нильсон, Байлесчи: JavaScript для глубокого обучения.",
        "description": "Пора научиться использовать TensorFlow.js для построения моделей глубокого обучения, работающих непосредственно в браузере! Умные веб-приложения захватили мир, а реализовать их в браузере или серверной части позволяет TensorFlow.js. Данная библиотека блестяще портируется, ее модели работают везде, где работает JavaScript. Специалисты из Google Brain создали книгу, которая поможет решать реальные прикладные задачи. Вы не будете скучать над теорией, а сразу освоите базу глубокого обучения и познакомитесь с продвинутыми концепциями ИИ на примерах анализа текста, обработки речи, распознавания образов и самообучающегося игрового искусственного интеллекта.",
        "price": 3596
    },
    {
        "id_product": 4,
        "imgProduct": "img/product-card-4.png",
        "product_name": "Фримен, Робсон: Изучаем программирование на JavaScript",
        "description": "Вы готовы сделать шаг вперед в веб-программировании и перейти от верстки в HTML и CSS к созданию полноценных динамических страниц? Тогда пришло время познакомиться с самым 'горячим' языком программирования - JavaScript! С помощью этой книги вы узнаете все о языке JavaScript - от переменных до циклов. Вы поймете, почему разные браузеры по-разному реагируют на код и как написать универсальный код, поддерживаемый всеми браузерами. Вам станет ясно, почему с кодом JavaScript никогда не придется беспокоиться о перегруженности страниц и ошибках передачи данных. Не пугайтесь, даже если ранее вы не написали ни одной строчки кода, - благодаря уникальному формату подачи материала эта книга с легкостью проведет вас по всему пути обучения: от написания простейшего скрипта до создания сложных веб-проектов, которые будут работать во всех современных браузерах. Особенностью этого издания является уникальный способ подачи материала, выделяющий серию 'Head First' издательства O'Reilly в ряду...",
        "price": 2630
    },
    {
        "id_product": 5,
        "imgProduct": "img/product-card-5.png",
        "product_name": "Итан Браун: Веб-разработка с применением Node и Express. Полноценное использование стека JavaScript",
        "description": "Создавайте динамические веб-приложения с применением Express - ключевого компонента из стека разработки Node/JavaScript. Итан Браун описывает работу с Express 5 на примере создания полноценного приложения. В книге рассматриваются все этапы и компоненты - от серверного рендеринга до разработки API для работы с одностраничными приложениями (SPA). Express является золотой серединой между устоявшимся фреймворком и отсутствием фреймворка вообще, поэтому он оставляет вам определенную свободу при архитектурном выборе. Эта книга предоставит лучшие решения для фронтенд- и бэкенд-разработчиков, использующих Express. Научитесь смотреть на веб-разработку под новым углом!Создайте систему шаблонизации для отображения динамических данных.Подробно изучите объекты запроса и отклика, промежуточное ПО и маршрутизацию URL-адресов. Создайте симуляцию продакшен-среды и выполняйте в ней тестирование.",
        "price": 2090
    },
    {
        "id_product": 6,
        "imgProduct": "img/product-card-6.png",
        "product_name": "Резиг, Бибо, Марас: Секреты JavaScript ниндзя",
        "description": "Язык JavaScript быстро становится универсальным для разработки различных типов приложений, будь то для веб, облака, настольных систем или мобильных устройств. Стать профессиональным разработчиком приложений на JavaScript - означает, приобрести ряд эффективных навыков, которые могут пригодиться во всех этих предметных областях. Во втором издании данной книги на многих практических примерах ясно демонстрируется каждое основное понятие или методика. Это издание было полностью переработано с целью показать, как овладеть такими понятиями JavaScript, как функции, замыкания, объекты, прототипы и обещания. В нем рассматриваются и такие понятия, как модель DOM, события и таймеры, а также нормы передовой практики программирования, в том числе тестирование и разработка кросс-браузерного кода. И все это подается с позиции опытных практикующих специалистов по JavaScript, которыми являются авторы книги.",
        "price": 4322
    }
]